app/controllers/dictionary_controller.rb

SELECT * FROM "segments" WHERE ('以' LIKE (simple || '%')) ORDER BY length(simple) DESC
---
def lup
    segment = params[:segment]

    # @result = Segment.find_by_sql(["select *, (select max(length(simple)) from segments WHERE (? LIKE (simple || '%'))) as q from segments where (? LIKE (simple || '%')) AND length(simple) = q", segment, segment])
    # @result = Segment.find_by_sql(["select * from segments where (? LIKE (simple || '%')) order by length(simple) DESC", segment])

   @result = Segment.find(:all, :conditions => ["? LIKE (simple || '%')", segment], :order => "length(simple) DESC")